package controllers

import ()

////////////////////////////////////////////////////////////////////////////////
// 处理回调的管理

/******************************************************************************
 **函数名称: Register
 **功    能: 注册处理回调
 **输入参数:
 **     cmd: 消息类型
 **     cb: 处理回调
 **输出参数: NONE
 **返    回: 0:成功 !0:失败
 **实现描述:
 **注意事项: 使用读锁
 **作    者: # Qifeng.zou # 2017.02.09 23:50:28 #
 ******************************************************************************/
func (obj *MesgCallbackObj) Register(cmd uint32, cb MesgCallback) {
	obj.Lock()
	obj.callback[cmd] = cb
	obj.Unlock()
	return 0
}

/******************************************************************************
 **函数名称: Query
 **功    能: 查找处理回调
 **输入参数:
 **     cmd: 消息类型
 **输出参数: NONE
 **返    回: 回调函数指针
 **实现描述:
 **注意事项: 使用读锁
 **作    者: # Qifeng.zou # 2017.02.09 23:50:28 #
 ******************************************************************************/
func (obj *MesgCallbackObj) Query(cmd uint32) MesgCallback {
	obj.RLock()
	cb, ok := obj.callback[cmd]
	if !ok {
		obj.RUnlock()
		return nil
	}
	obj.RUnlock()

	return cb
}

////////////////////////////////////////////////////////////////////////////////
